## Plans :thumbsup:

Outputs can be viewed in the Terrateam Console [here](https://app.terrateam.io/i/64340904/runs/e23ebf3d-5054-456f-b3aa-37db0a75cd5b).

## Terrateam Plan Output :thumbsup:
<details>
  <summary>Expand for plan output details</summary>


## Dir: . | Success :thumbsup:
**Dir**: .
**Workspace**: default
**Success**: :thumbsup:

**Step**: plan
**Success**: :thumbsup:
```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.atlas_schema.terrateam will be read during apply
  # (config refers to values not yet known)
 <= data "atlas_schema" "terrateam" {
+       dev_db_url = (sensitive value)
+       hcl        = (known after apply)
+       id         = (known after apply)
+       src        = <<-EOT
            #CREATE TABLE users (
            #  id UUID PRIMARY KEY,
            #  name TEXT NOT NULL,
            #  is_admin BOOLEAN NOT NULL DEFAULT (FALSE),
            #  api_key VARCHAR(64) UNIQUE NOT NULL DEFAULT (encode(sha256(random()::text::bytea), 'hex')
            #  );
            
            
            schema "public" {
              comment = "Default PostgreSQL schema"
            }
            
            table "users" {
              schema = schema.public
              column "id" {
                type = uuid
                null = false
              }
              column "name" {
                type = text
                null = false
              }
              column "isadmin" {
                type = boolean
                null = false
                default = false
              }
              primary_key {
                columns = [column.id]
              }
            }
        EOT
    }

  # atlas_schema.terrateam will be created
+   resource "atlas_schema" "terrateam" {
+       hcl = (known after apply)
+       id  = (known after apply)
+       url = (sensitive value)
    }

  # aws_db_instance.terrateam must be replaced
-/+ resource "aws_db_instance" "terrateam" {
!       address                               = "terrateam.c3gmg4ewaocx.eu-west-1.rds.amazonaws.com" -> (known after apply)
!       arn                                   = "arn:aws:rds:eu-west-1:***:db:terrateam" -> (known after apply)
!       availability_zone                     = "eu-west-1a" -> (known after apply)
!       backup_retention_period               = 0 -> (known after apply)
!       backup_target                         = "region" -> (known after apply)
!       backup_window                         = "02:38-03:08" -> (known after apply)
!       ca_cert_identifier                    = "rds-ca-rsa2048-g1" -> (known after apply)
+       character_set_name                    = (known after apply)
-       customer_owned_ip_enabled             = false -> null
!       database_insights_mode                = "standard" -> (known after apply)
+       db_name                               = "terrateam" # forces replacement
-       deletion_protection                   = false -> null
-       domain_dns_ips                        = [] -> null
+       domain_fqdn                           = (known after apply)
-       enabled_cloudwatch_logs_exports       = [] -> null
!       endpoint                              = "terrateam.c3gmg4ewaocx.eu-west-1.rds.amazonaws.com:5432" -> (known after apply)
!       engine_lifecycle_support              = "open-source-rds-extended-support" -> (known after apply)
!       engine_version_actual                 = "17.2" -> (known after apply)
!       hosted_zone_id                        = "Z29XKXDKYMONMX" -> (known after apply)
-       iam_database_authentication_enabled   = false -> null
!       id                                    = "db-YX3NB2FWQ2563VLE2PI46N27ZU" -> (known after apply)
+       identifier_prefix                     = (known after apply)
!       iops                                  = 0 -> (known after apply)
+       kms_key_id                            = (known after apply)
+       latest_restorable_time                = (known after apply)
!       license_model                         = "postgresql-license" -> (known after apply)
!       listener_endpoint                     = [] -> (known after apply)
!       maintenance_window                    = "mon:23:32-tue:00:02" -> (known after apply)
!       master_user_secret                    = [] -> (known after apply)
+       master_user_secret_kms_key_id         = (known after apply)
-       max_allocated_storage                 = 0 -> null
+       monitoring_role_arn                   = (known after apply)
!       multi_az                              = false -> (known after apply)
+       nchar_character_set_name              = (known after apply)
!       network_type                          = "IPV4" -> (known after apply)
!       option_group_name                     = "default:postgres-17" -> (known after apply)
!       parameter_group_name                  = "default.postgres17" -> (known after apply)
+       performance_insights_kms_key_id       = (known after apply)
!       performance_insights_retention_period = 0 -> (known after apply)
!       port                                  = 5432 -> (known after apply)
+       replica_mode                          = (known after apply)
!       replicas                              = [] -> (known after apply)
!       resource_id                           = "db-YX3NB2FWQ2563VLE2PI46N27ZU" -> (known after apply)
+       snapshot_identifier                   = (known after apply)
!       status                                = "available" -> (known after apply)
-       storage_encrypted                     = false -> null
!       storage_throughput                    = 0 -> (known after apply)
-       tags                                  = {} -> null
!       tags_all                              = {} -> (known after apply)
+       timezone                              = (known after apply)
        # (26 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 1 to destroy.

```

</details>

## Cost Estimation
**Total Monthly Difference: 0.00 USD**
<details>
  <summary>Expand for cost estimation details</summary>

| Dir | Workspace | Previous (USD) | New (USD) | Diff (USD) |
| :---: | :---: | ---: | ---: | ---: |
| . | default | 15.87 | 15.87 | 0.00|
| | **Total** | **15.87** | **15.87** | **0.00** |
</details>

---

To apply all these changes, comment:

```
terrateam apply
```

---

<details>
  <summary><h3>Feedback?</h3></summary>

Questions? Comments? Give feedback by commenting `terrateam feedback <your msg>`.  Your message lands directly in our inbox.

</details>
